# Reading data
Read the train.csv file as a pandas dataframe.

In [4]:
import pandas as pd
df_train = pd.read_csv("data/train.csv")
df_test = pd.read_csv("data/test.csv")
df_train.head(5)
df_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'

5. Print all information about the oldest passenger.

In [ ]:
#Mi solución
def passenger_id(id):
    name = df_train.loc[df_train["PassengerId"] == id, "Name"].values[0]
    return name
print(passenger_id(69))
#La del profesor
def id_to_name(id:int,df:pd.DataFrame)->str:
    """_summary_

    Args:
        id (int): _description_
        df (pd.DataFrame): _description_

    Returns:
        str: _description_
    """
    return df[df["PassengerId"]==id]["Name"].values[0]
print(id_to_name(75,df_train))

#2
def name_to_id(name):
    return df_train.loc[df_train["Name"]==name,"PassengerId"].values[0]
print(name_to_id("Montvila, Rev. Juozas"))
#3
def print_id(name):
    id = name_to_id(name)
    print(f"The ID of passenger {name} is {id}")
print_id("Montvila, Rev. Juozas")
#4
def print_name(id):
    name = passenger_id(id)
    print(f"The name of passenger {id} is {name}")
print_name(887)
#%
def print_person():
    oldest = df_train.loc[df_train.loc[:,"Age"].idxmax()]
    return oldest
print(print_person())

Andersson, Miss. Erna Alexandra
Bing, Mr. Lee
887
The ID of passenger Montvila, Rev. Juozas is 887
The name of passenger 887 is Montvila, Rev. Juozas
PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6. Create and save the new dataset in **data/port_fares.csv**.

In [40]:
df_5 = df_train.loc[:,["Ticket","Fare","Embarked"]]
df_5.head(100)

              Ticket     Fare Embarked
0          A/5 21171   7.2500        S
1           PC 17599  71.2833        C
2   STON/O2. 3101282   7.9250        S
3             113803  53.1000        S
4             373450   8.0500        S
..               ...      ...      ...
95            374910   8.0500        S
96          PC 17754  34.6542        C
97          PC 17759  63.3583        C
98            231919  23.0000        S
99            244367  26.0000        S

[100 rows x 3 columns]

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.